Revit 2026 API

# Units Class

---

A document's default settings for formatting numbers with units.

SystemObject Autodesk.Revit.DBUnits

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Units : IDisposable
```
```vb
Public Class Units
	Implements IDisposable
```
```cpp
public ref class Units : IDisposable
```
```fsharp
type Units =
    class
        interface IDisposable
    end
```

The Units type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Units | Creates a new Units object with default settings for Metric or Imperial units. |

|  | Name | Description |
| --- | --- | --- |
|  | DecimalSymbol | The symbol used to separate the integer and fractional parts of a number. |
|  | DigitGroupingAmount | The number of digits in each group when numbers are formatted with digit grouping. |
|  | DigitGroupingSymbol | The symbol used to separate groups of digits when numbers are formatted with digit grouping. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Units |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFormatOptions | Gets the default FormatOptions for a spec. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModifiableSpecs | Gets all specs for which the default FormatOptions can be modified. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsModifiableSpec | Checks whether the default FormatOptions can be modified for a given spec. |
|  | SetFormatOptions | Sets the default FormatOptions for a spec. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The Units class represents a document's default settings for formatting numbers with units as strings. It contains a FormatOptions object for each unit type as well as settings related to decimal symbol and digit grouping.

The Units class stores a FormatOptions object for every valid unit type, but not all of them can be directly modified. Some, like UT_Number and UT_SiteAngle, have fixed definitions. Others have definitions which are automatically derived from other unit types. For example, UT_SheetLength is derived from UT_Length and UT_ForceScale is derived from UT_Force. See IsModifiableUnitType() and GetModifiableUnitTypes().

#### Reference

Autodesk.Revit.DB Namespace